Revit 2025 API
BoundaryConditionsOrientTo Enumeration
 Specifies boundary condition orientation.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum BoundaryConditionsOrientTo
Public Enumeration BoundaryConditionsOrientTo
public enum class BoundaryConditionsOrientTo
type BoundaryConditionsOrientTo
Members
Member name | Value | Description
Project | 0 |  Boundary condition is oriented in respect to project global coordinate system, that is X to East, Y to North, and Z to up.
HostLocalCoordinateSystem | 1 |  Boundary condition is oriented in respect to it analytical host element coordinate system and will follow host changes.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace